DataProcessors/МИКО_опОптимизация_ЗаполнитьИндексТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МИКО_опОптимизация_ЗаполнитьИндексТелефонов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефоновБуквенные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефоновБуквенные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/МИКО_опОптимизация_ЗаполнитьИндексТелефонов/Forms/Форма/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
	Если ПозицияЗагрузкиКодовГородов <> 0 Тогда
	 	Элементы.декИнфо.Заголовок = "Прогресс заполнения регистра: всего записей 285000 ";
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьИндексНомеров(Команда)
	ПерезаполнитьИндексНомеровНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПерезаполнитьИндексНомеровНаСервере()
	
	МассивСправочниковКИ = Новый Массив;
	Для каждого Источник Из Метаданные.Справочники Цикл
		// наличие таблицы КИ
		КонтактнаяИнформация = Источник.ТабличныеЧасти.Найти("КонтактнаяИнформация");
		Если КонтактнаяИнформация = Неопределено Тогда
		  	Продолжить;
		КонецЕсли;                                        
		// наличие прав доступа к таблице КИ
		Если НЕ ПравоДоступа("Чтение", Источник)
			 ИЛИ НЕ ПравоДоступа("Чтение", Источник.ТабличныеЧасти.КонтактнаяИнформация) Тогда
			Продолжить;
		КонецЕсли; 
		// наличие реквизитов
		Если КонтактнаяИнформация.реквизиты.Найти("НомерТелефона")=Неопределено Тогда
		   	Продолжить;
		КонецЕсли;
		
		МассивСправочниковКИ.Добавить(Источник.Имя);
	КонецЦикла; 
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ {РАЗРЕШЕННЫЕ} 
		|	{Имя}КонтактнаяИнформация.Ссылка
		|ИЗ
		|	Справочник.{Имя} КАК {Имя}КонтактнаяИнформация";
	ТекстЗапроса = "";
	Для Каждого врТекИмя Из МассивСправочниковКИ Цикл
		Если Не ТекстЗапроса = "" Тогда
		  	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "");
		Иначе
			врЗапрос = СтрЗаменить(ШаблонЗапроса, "{РАЗРЕШЕННЫЕ}", "РАЗРЕШЕННЫЕ");
			врЗапрос = СтрЗаменить(врЗапрос, "//{ПОМЕСТИТЬ}", "ПОМЕСТИТЬ");
		КонецЕсли; 
		врЗапрос = СтрЗаменить(врЗапрос, "{Имя}", врТекИмя);
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + врЗапрос + Символы.ПС;
	КонецЦикла; 
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Запрос = Новый Запрос(ТекстЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Попытка
			    врОбъект = Выборка.Ссылка.ПолучитьОбъект();
				врОбъект.Записать();
			Исключение
			КонецПопытки; 
		КонецЦикла;
	КонецЕсли; 
		
	// заполним индексы по данным РС "КонтактнаяИнформация"
	ЕстьРегистрКонтактнаяИнформация = (НЕ Метаданные.РегистрыСведений.Найти("КонтактнаяИнформация") = Неопределено);
	Если НЕ ЕстьРегистрКонтактнаяИнформация Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект КАК Объект,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|ИТОГИ ПО
	|	Объект";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ВыборкаПоОбъектам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОбъектам.Следующий() Цикл
	
		ОбъектКИ = ВыборкаПоОбъектам.Объект;
		
		ВыборкаПоТелефонам = ВыборкаПоОбъектам.Выбрать();
		
		Буквенные = Новый Массив;
		Числовые  = Новый Массив;
		
		Пока ВыборкаПоТелефонам.Следующий() Цикл
			Представление = ""+ВыборкаПоТелефонам.Поле1+ВыборкаПоТелефонам.Поле2+ВыборкаПоТелефонам.Поле3;
			Если ЗначениеЗаполнено(ВыборкаПоТелефонам.Поле4) И НЕ ЗначениеЗаполнено(Представление) Тогда
				НомерТелефона = "" + ВыборкаПоТелефонам.Поле4;
			Иначе
				НомерТелефона = "" + ВыборкаПоТелефонам.Поле1 + ВыборкаПоТелефонам.Поле2 + ВыборкаПоТелефонам.Поле3;
			КонецЕсли; 
			
			// Наполним массивы номеров для обновления информации в истории звонков.
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(Представление, """' /*+=\,!;%:?()");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
				Продолжить;
			КонецЕсли; 

			Если МИКО_опЗаписьКИ.ЭтоЧисловойНомер(НомерТелефона) Тогда
				НомерТелефона = МИКО_опЗаписьКИ.УбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона);
				Если Числовые.Найти(НомерТелефона)=Неопределено Тогда
					Числовые.Добавить(НомерТелефона);
				КонецЕсли; 
			ИначеЕсли МИКО_опЗаписьКИ.ВСловеТолькоЛатиница(НомерТелефона) Тогда
				// Это скайп
				Если Буквенные.Найти(НомерТелефона)=Неопределено Тогда
					Буквенные.Добавить(НомерТелефона);
				КонецЕсли; 
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла; 
		
		НаборЗаписей = РегистрыСведений.МИКО_опИндексНомераТелефонов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);

		НаборЗаписейБуквенные = РегистрыСведений.МИКО_опИндексНомераТелефоновБуквенные.СоздатьНаборЗаписей();
		НаборЗаписейБуквенные.Отбор.СсылкаНаКлиента.Установить(ОбъектКИ);
			
		Если Числовые.Количество()>0 Тогда
			Для каждого текНомер Из Числовые Цикл
			 	новЗапись = НаборЗаписей.Добавить();
				новЗапись.НомерТелефонаИндекс = МИКО_опЗаписьКИ.ПреобразоватьНомерДляСохранения(текНомер);
			    новЗапись.СсылкаНаКлиента 	  = ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой= МИКО_опЗаписьКИ.УбратьИзСтрокиТелефонаВсеБуквы(текНомер);
			КонецЦикла; 
		КонецЕсли; 
		
		Если Буквенные.Количество()>0 Тогда
			Для каждого текНомер Из Буквенные Цикл
			 	новЗапись = НаборЗаписейБуквенные.Добавить();
				новЗапись.НомерТелефонаИндекс 	= СтрЗаменить(текНомер," ","");
			    новЗапись.СсылкаНаКлиента 		= ОбъектКИ;
			    новЗапись.НомерТелефонаСтрокой 	= СтрЗаменить(текНомер," ","");
			КонецЦикла; 
		КонецЕсли; 
		
		Попытка
		НаборЗаписей.Записать();                                   
		Исключение
		КонецПопытки; 
		
		Попытка
		НаборЗаписейБуквенные.Записать();                                   
		Исключение
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодыГородов(Команда)
	ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
	Если ПозицияЗагрузкиКодовГородов = 0 Тогда
	 	УстановитьТекущуюПозицию(1);
	КонецЕсли; 
	
	НачатьЗагрузкуЗаписей(); 
КонецПроцедуры

&НаКлиенте
// Процедура инициирует очередной этап загрузки кодов городов.
// Объем записей довольно большой, по этой причине процедура выполняет загрузку этапами по 100000 записей за раз.
// 
Процедура НачатьЗагрузкуЗаписей()
	ДатаНачала = ТекущаяДата();
	НомерПопытки 		= 0;
	КодыУкраиныЗаписаны = Ложь;
	TimeZones			= Неопределено;

	Пока Истина Цикл
		
		МИКО_опЗаписьКИ.ЗагрузитьКодыГородов(НомерПопытки, КодыУкраиныЗаписаны, TimeZones);
		ПозицияЗагрузкиКодовГородов = ПолучитьТекущуюПозицию();
		Если ПозицияЗагрузкиКодовГородов <> 0 Тогда
		 	Элементы.декИнфо.Заголовок = "Прогресс заполнения регистра: " + ПозицияЗагрузкиКодовГородов + " всего записей 285000, загружено ";
		Иначе
			Элементы.декИнфо.Заголовок = "Загрузка завершена";
			Прервать;
		КонецЕсли;
		
		Если ТекущаяДата() - ДатаНачала > 3600 Тогда
		 	Элементы.декИнфо.Заголовок = "Загрузка остановлена: " + ПозицияЗагрузкиКодовГородов + " всего записей 285000, загружено ";
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры
 
&НаСервереБезКонтекста
// Возврвщает текущую позицию загрузки данных.
// Если загрузка завершена - возвратит 0;
// 
Функция ПолучитьТекущуюПозицию()

 	ПозицияЗагрузкиКодовГородов = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов();
   	Возврат ПозицияЗагрузкиКодовГородов;
КонецФункции // ПолучитьТекущуюПозицию()

&НаСервереБезКонтекста
// Корректирует текущую позицию загрузки данных.
// 
Процедура УстановитьТекущуюПозицию(позиция)

 	ПозицияЗагрузкиКодовГородов = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.ПозицияЗагрузкиКодовГородов(позиция);
КонецПроцедуры // ПолучитьТекущуюПозицию()

// #КонецОбласти
